Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/loans_and_credit/borrowing_money_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: At some stage in life most people are likely to borrow money
ga: D’fhéadfadh sé go mbeadh ar an gcuid is mó againn airgead a fháil ar iasacht ag tráth éigin dár saol

source: There are many different types of credit and loans
ga: Is iomaí cineál creidmheas difriúil ann

source: You should get the right loan for your needs and should shop around for the best loan
ga: Ba chóir do dhaoine an iasacht cheart a oirfidh dá riachtanais a fháil agus breathnú i gcúpla áit chun an iasacht is fearr a fháil

source: Consumers who borrow money are protected in legislation by the Consumer Credit Act 1995
ga: Bíonn tomhaltóirí a fhaigheann airgead ar iasacht in Éirinn faoi chosaint sa reachtaíocht ag an Acht um Chreidmheas do Thomhaltóirí 1995

source: This Act covers all types of credit and credit institutions must comply with this law
ga: Clúdaíonn an tAcht sin gach cineál creidmheasa agus ní mór d'institiúidí creidmheasa comhlíonadh leis an dlí sin

source: The Act also prescribes the ways in which credit may be advertised
ga: Forordaíonn an tAcht freisin na bealaí inar féidir creidmheas a fhógairt

source: If you are having trouble paying off a loan the Money Advice and Budgeting Service (MABS) may be able to help
ga: Má bhíonn deacracht agat iasacht a thug tú amach roimhe seo a íoc ar ais, b’fhéidir go mbeadh an tSeirbhís Bhuiséadta agus Chomhairle Airgid in ann cabhrú leat

source: Generally, banks, building societies and other credit institutions charge for the use of borrowed money
ga: Go ginearálta, gearrann bainc, cumainn foirgníochta agus institiúidí creidmheasa eile muirear ar airgead ar iasacht a úsáid

source: This payment is called 'interest' and it is calculated on the amount of money you borrow and the length of time that you borrow it
ga: Tugtar ‘ús’ ar an íocaíocht seo agus ríomhtar é ar an tsuim airgid a fhaigheann tú ar iasacht agus ar an bhfad ama dá bhfaigheann tú ar iasacht é

source: You may also have to pay fees to cover administrative expenses on your loan
ga: Anuas air sin, b’fhéidir go mbeidh ort táillí a íoc chun íoc as costais riaracháin ar d’iasacht

source: Before you borrow money
ga: Sula bhfaigheann tú airgead ar iasacht

source: If you are borrowing money or buying goods it is important that you ensure that you can afford to pay back what you borrow
ga: Má bhíonn tú ag fáil airgid ar iasacht nó ag ceannach earraí ar fruilcheannach tá sé tábhachtach go ndéanfá cinnte go mbeidh sé ar d’acmhainn an méid atá tú ag dul a fháil ar iasacht a íoc ar ais

source: Be realistic about your living costs
ga: Bí ciallmhar faoi na costais mhaireachtála atá ort

source: Make sure that any money you have left after you pay for essentials is sufficient to cover the cost of a loan
ga: Déan cinnte go mbeidh aon airgead a bheidh fágtha agat tar éis do chuid bunriachtanais a íoc in ann costas iasachta a chlúdach

source: Check whether you can save enough money to buy what you need rather than getting a loan
ga: Seiceáil an mbeifeá in ann dóthain airgid a chur i dtaisce chun an rud a theastaíonn uait a cheannach in ionad iasacht a fháil?

source: You can also reduce the amount that you may need to borrow by using money that you have saved
ga: D’fhéadfá an méid a bheadh ort a thógáil ar iasacht a laghdú freisin trí airgead atá i dtaisce agat a úsáid

source: Get a loan to suit your needs
ga: Faigh iasacht a oirfidh do do chuid riachtanas

source: There are many different types of loans and credit
ga: Is iomaí cineál iasachta agus creidmheasa ann

source: Each type of credit is suitable for a different purpose
ga: Bíonn gach cineál creidmheasa oiriúnach le haghaidh críche ar leith

source: Some are more suited to short-term borrowing and others are more suited to medium to long-term borrowing
ga: Tá creidmheas ann a oireann d'airgead a fháil ar iasacht ghearrthéarmach agus cinn eile a oireann níos fearr d'airgead a fháil ar iasacht fhadtéarmach

source: Shop around for the best value
ga: Cuardaigh thart chun luach d’airgid a fháil

source: Banks, building societies and credit unions all offer a range of loans
ga: Tairgeann bainc, cumainn foirgníochta agus comhair chreidmheasa réimse iasachtaí

source: When comparing charges for the use of borrowed money, interest on loans must be presented as the Annual Percentage Rate (APR)
ga: Nuair a bhítear ag déanamh comparáide ar tháillí chun airgead a bhíonn ar iasacht a úsáid, ní mór ús ar iasachtaí a chur i láthair mar an Ráta Céatadánach Bliantúil (RCB)

source: The APR states what percentage of the amount you borrow you will be charged in addition to paying back the loan amount
ga: Tugtar le fios leis an RCB an céatadán den tsuim atá ar iasacht agat a ghearrfar mar tháille ort anuas ar shuim na hiasachta a bheidh le híoc ar ais

source: It is important that you compare like with like
ga: Tá sé tábhachtach go gcuirfidh tú gach figiúr i gcomparáid lena chéile

source: Loans can be paid back over different terms or lengths of time
ga: Is féidir iasachtaí a íoc ar ais thar théarmaí difriúla nó achair dhifriúla

source: You may think that you are getting a good deal on a loan with a low APR but if you are paying more instalments over a longer period of time you may find that it will cost you more
ga: B’fhéidir go gceapfá go bhfuil tú ag fáil margadh maith ar iasacht le RCB íseal ach má bhíonn tú ag íoc níos mó tráthchodanna thar thréimhse níos faide b'fhéidir gur mó costais a bheadh ort leis sa deireadh

source: Cost of credit is another way of comparing loans which looks at the total cost of the loan
ga: Is bealach eile chun iasachtaí a chur i gcomparáid le chéile é costas creidmheasa a bhreathnaíonn ar chostas iomlán na hiasachta

source: The Central Bank authorises banks, building societies and credit unions
ga: Údaraíonn an Banc Ceannais na hÉireann bainc, cumainn foirgníochta agus comhair chreidmheasa

source: You should only borrow from an authorised financial service provider
ga: Ba chóir iasacht a fháil ó sholáthróir seirbhíse airgeadais údaraithe agus sin amháin

source: This protects you and your money from unscrupulous lenders
ga: Tugann sé sin cosaint duitse agus do do chuid airgid ó dhaoine mí-mhacánta a thugann iasachtaí

source: If you are unsure if the company that you are dealing with is authorised contact the Central Bank to find out
ga: Mura bhfuil tú cinnte gur cuideachta údaraithe í an chuideachta a bhfuil tú ag déileáil léi, déan teagmháil leis Banc Ceannais na hÉireann chun é sin a fháil amach

source: You can access a loan calculator to help you work out repayments on a loan at consumerhelp.ie
ga: Féadfaidh tú áireamhán iasachta a rochtain chun cabhrú leat aisíocaíochtaí a dheimhniú ar iasacht ar consumerhelp.ie

source: You can also compare personal loans, credit cards and overdrafts with financial product comparison tools
ga: Ina theannta sin, féadfaidh tú iasachtaí pearsanta, cártaí creidmheasa agus rótharraigntí a chur i gcomparáid le huirlisí comparáide táirgí airgeadais

source: There are many different forms of credit including:
ga: Tá go leor foirmeacha éagsúla ann de chreidmheas, lena n-áirítear:

source: • Overdrafts: An overdraft is a way of borrowing on your bank account
ga: • Rótharraingtí: Is bealach é rótharraingt iasacht a fháil ar do chuntas bainc

source: Overdrafts are given on your current account so that when your balance is 0 in your account you can still spend up to a certain limit
ga: Tugtar rótharraingtí ar do chuntas reatha ionas nuair a bhíonn an t-iarmhéid ag 0 i do chuntas is féidir leat roinnt a chaitheamh fós féin go dtí teorainn áirithe

source: • Credit cards: A credit card allows you to borrow money on a monthly basis
ga: • Cártaí creidmheasa: Tugann cárta creidmheasa deis duit airgead a fháil ar iasacht ar bhonn míosúil

source: There is no interest charged on borrowings if you pay your full bill within a set number of days
ga: Tá cárta creidmheasa solúbtha agus is féidir iad a úsáid chun íoc as ábhair agus seirbhísí ar líne nó ar an teileafón

source: Credit cards are flexible and can be used to pay for items and services that you may buy on-line or by telephone
ga: Glactar le cártaí creidmheasa mar bhealach chun íoc as earraí agus seirbhísí i go leor áiteanna ar fud an domhain

source: Credit cards are accepted as a means of payment for goods and services or for accessing cash in other countries
ga: Níl siad oiriúnach le haghaidh iasachta fadtéarmaí de bhrí go bhfuil na rátaí úis ard

source: They are not suitable for long-term borrowing as interest rates are high
ga: Bíonn cártaí creidmheasa áisiúil do thomhaltóirí má bhíonn fadhb agat le hábhar atá ceannaithe agat

source: If you have a problem with an item you have purchased your credit card bill or statement can be used as proof of purchase
ga: Sa chás sin is féidir leat bille an chárta creidmheas a úsáid mar chruthúnas gur cheannaigh tú rud éigin

source: • Personal loans (from banks or building societies): Banks and building societies offer personal loans to customers
ga: • Iasachtaí pearsanta (ó bainc nó cumainn foirgníochta): Tairgeann bainc agus cumainn foirgníochta iasachtaí pearsanta do chustaiméirí

source: These loans are suitable for medium and longer term needs, for example, a car loan or a loan for home improvements
ga: Bíonn na hiasachtaí sin oiriúnach le haghaidh riachtanas meántéarmach agus fadtéarmach, mar shampla, iasacht cairr nó iasacht chun feabhas a chur ar an teach

source: Banks or building societies may also charge other fees and charges
ga: D’fhéadfadh bainc nó cumainn foirgníochta táille a ghearradh chomh maith as táillí agus muirir eile

source: Generally, you pay a fixed amount back every month
ga: Go hiondúil, íocann tú suim seasta ar ais gach mí

source: If your loan is a variable rate loan you may be able to pay more than this back when you have it
ga: Más iasacht úis inathraithe í d’iasacht b’fhéidir go mbeifeá in ann níos mó ná an suim seasta a íoc ar ais nuair a bhíonn sé agat

source: This allows you to pay off the loan sooner
ga: Tugann sé sin deis duit an iasacht a íoc ar ais níos túisce

source: It is not advisable to take out personal loans to cover day-to-day expenses
ga: Ní mholtar iasacht phearsanta a thógáil amach chun costais laethúla a chlúdach

source: • Credit union loans: Credit unions also offer loans to consumers
ga: • Iasachtaí as comhar creidmheasa: Tairgeann comhair chreidmheasa iasachtaí do chustaiméirí freisin

source: You must be a member of a credit union before you can take out a loan
ga: Caithfidh tú a bheith i do bhall de chomhar creidmheasa sular féidir leat iasacht a fháil uaidh

source: Credit unions are based in the community or workplace and you must be living or working in a particular area or working for a particular employer to become a member
ga: Bíonn na comhair chreidmheasa bunaithe sa phobal nó sa láthair oibre agus caithfidh tú a bheith i do chónaí nó ag obair i gceantar áirithe nó ag obair d’fhostóir áirithe le bheith i do bhall

source: You may need to have saved some money in a credit union before getting a loan
ga: B’fhéidir go mbeadh ort airgead a bheith i dtaisce agat i gcomhar creidmheasa sula bhfaigheann tú iasacht

source: Credit union loans are suitable for short and longer-term needs such as loans for holidays or cars. They are also useful for refinancing other loans
ga: Bíonn iasachtaí ó chomhar creidmheasa oiriúnach le haghaidh riachtanas gearrthéarmach agus níos fadtéarmaí mar iasachtaí le haghaidh laethanta saoire nó carranna

source: Some credit unions are offering a new type of loan called an It Makes Sense loan
ga: Bíonn siad áisiúil freisin le hiasacht eile a athmhaoiniú

source: • Hire purchase: This is a hire agreement offered by shops or garages so that you can hire and eventually buy particular items
ga: • Fruilcheannach: Is comhaontuithe fruilithe iad seo a thairgeann siopaí nó garáiste ionas gur féidir leat rudaí áirithe a fhruiliú agus a cheannach de réir a chéile

source: Items bought on hire purchase are normally expensive items such as a car or furniture or electronic equipment
ga: Bíonn rudaí a cheannaítear ar fruilcheannach daor go hiondúil, mar shampla carr nó troscán nó trealamh leictreachais

source: You do not own the item until the last instalment of the loan is paid
ga: Ní leatsa an rud go dtí go mbíonn an tráthchuid deiridh den iasacht íoctha

source: While the Central Bank regulates finance companies, the Competition and Consumer Protection Commission regulates credit intermediaries (as well as pawnbrokers)
ga: Tá comhlachtaí airgeadais rialaithe ag an Banc Ceannais na hÉireann agus tá idirghabhálaí creidmheasa (chomh maith le geallbhróicéirí) rialaithe ag an gCoimisiún um Iomaíocht agus Cosaint Tomhaltóirí

source: In a hire purchase agreement ownership of the items passes to you after the last instalment is paid
ga: I gcomhaontú fruilcheannaigh i d’úinéir ar na rudaí i ndiaidh duit an tráthchuid deiridh a íoc

source: In a consumer hire agreement the goods are hired and will always belong to the consumer hire company
ga: I gcomhaontú fruile tomhaltóirí faightear na hearraí ar cíos agus is leis an gcuideachta cíosa tomhaltóirí iad i gcónaí

source: • Credit sale agreements: These agreements are similar to hire purchase agreements in that an item is purchased and paid for in instalments
ga: • Comhaontuithe díol creidmheasa: Tá na comhaontuithe sin cosúil le comhaontuithe fruilcheannach sa mhéid go gceannaítear ábhar agus go n-íoctar as i dtráthchodanna

source: A major difference is that a buyer immediately owns the goods bought under a credit sale agreement
ga: Difríocht mhór is ea gur leis an úinéir na hearraí a cheannaítear ar an bpointe faoi chomhaontú díol creidmheasa

source: The APR charged on this type of loan is generally higher than that of credit cards but cannot be above 23%
ga: Go ginearálta bíonn an APR a ghearrtar ar an gcineál sin iasachta níos airde ná mar a bhíonn ar chártaí creidmheasa ach ní féidir leis a bheith os cionn 23%

source: Like hire purchase loans this type of credit is not flexible
ga: Ach an oiread le hiasachtaí fruilcheannaigh níl an cineál creidmheasa seo solúbtha

source: • Mortgages and top-up mortgages: If you are a homeowner a mortgage is the largest single financial product that you are likely to buy in your life
ga: • Airgead breise a fháil ar mhorgáiste: Más úinéir tí tú beidh a fhios agat gurb é an morgáiste an táirge airgeadais is mó as féin is dóigh a cheannóidh tú i do shaol

source: A top-up mortgage is a way of extending your mortgage to consolidate your debts or to pay for a car or other large purchase
ga: Is bealach é airgead breise ar mhorgáiste chun do mhorgáiste a leathnú chomh do chuid fiacha a chur le chéile nó chun íoc as carr nó rud éigin eile mór a cheannaíonn tú

source: Although APRs are low, this type of loan may cost you substantially more in the long run if you pay it back over a longer term
ga: D’fhéadfadh muirir eile a bheith i gceist le hiasacht den chineál seo a fháil

source: These loans - like your mortgage - are secured on your home so it is extremely important that you keep up repayments otherwise your home may be at risk
ga: Bíonn na hiasachtaí sin – ar nós do mhorgáiste – urraithe ar do theach agus tá sé thar a bheith tábhachtach mar sin go gcoinníonn tú leis na haisíocaíochtaí nó mura gcoinneoidh beidh do theach i mbaol

source: • Moneylending: Moneylending is the practice of giving cash loans or supplying goods or services that are repaid at a high level of interest over a short period of time
ga: • Iasachtú airgid: Is í an iasachtú airgid an nós iasachtaí airgid a thabhairt nó earraí nó seirbhísí a chur ar fáil a aisíoctar ar leibhéal ard úis laistigh de tamall gearr

source: Banks, building societies, insurance companies and credit unions are not considered moneylenders
ga: Ní mheastar bainc, cumainn fhoirgníochta, comhlachtaí árachais ná comhar chreidmheasa a bheith iasachtóírí airgid

source: Moneylenders are generally either individuals or companies whose main business is to lend money
ga: Is iasachtú airgid iad daoine nó comhlachtaí gurb é a bpríomhghnó é airgead a thabhairt ar iasacht

source: Credit history and your right to privacy
ga: Stair creidmheasa agus do cheart do phríobháideacht

source: If you have ever used credit you will have a credit history
ga: Má d’úsáid tú creidmheas roimhe seo beidh stair creidmheasa agat

source: A credit institution can refuse to give you a loan if you have not complied with the terms and conditions of previous loans
ga: Is féidir le hinstitiúid creidmheasa diúltú iasacht a thabhairt duit mura mbíonn téarmaí agus coinníollacha iasachtaí roimhe seo comhlíonta agat

source: The Irish Credit Bureau keeps a database of all borrowers and credit institutions can check the status of previous loans taken by a potential borrower
ga: Coinníonn Biúró Creidmheasa na hÉireann bunachar sonraí don lucht iasachta ar fad agus is féidir le hinstitiúidí creidmheasa stádas na n-iasachtaí a bhí ag iasachtaí ionchasach roimhe seo a sheiceáil

source: You can find out more about your credit rating and the Irish Credit Bureau
ga: Is féidir leat tuilleadh a fháil amach faoi do rátáil creidmheasa agus faoi Bhiúró Creidmheasa na hÉireann anseo

source: When you have entered into a credit agreement, the Consumer Credit Act 1995 protects your rights.Your entitlement to privacy is protected and there are rules about lenders contacting you
ga: Má dhéanann tú comhaontú creidmheasa, tugann an tAcht um Chreidmheas do Thomhaltóirí 1995 cosaint do do chearta. Tá do theidlíocht do phríobháideacht á cosaint agus tá rialacha faoi iasachtóirí ag déanamh teagmhála leat

source: These restrictions are legally binding on all lenders and are designed to protect your privacy as a consumer
ga: Tá na rialacha seo ina gceanglas dlíthiúil ar gach iasachtóir agus tá siad in ainm is do phríobháideacht mar thomhaltóir a chosaint

source: For example, the Act prohibits visits or telephone calls from an authorised financial institution about the agreement to you without your consent at any place between 9pm and 9am weekdays, or at any time on Sundays or public holidays
ga: Mar shampla, cuireann an tAcht cosc ar institiúid airgeadais údaraithe cuairt a thabhairt ort nó glaonna teileafóin a dhéanamh leat gan do thoiliú ag aon am idir 9i.n. agus 9r.n. ar feadh na seachtaine, nó ag aon am ar an Domhnach nó laethanta saoire bainc

source: Calls or visits to your place of work are prohibited unless you live there, or if reasonable efforts to contact you have failed
ga: Bíonn cosc ar chuairteanna chuig d’áit fostaíochta mura mbíonn cónaí ort ansin, nó má theip ar iarrachtaí eile teagmháil a dhéanamh leat

source: Only the person(s) involved in the credit agreement may be contacted (unless other arrangements have been made)
ga: Ní féidir a dhul i dteagmháil ach amháin leis an duine/na daoine sa chomhaontú creidmheasa (mura mbíonn socruithe eile déanta)

source: The Competition and Consumer Protection Commission (CCPC) provides information and education about the costs, risks and benefits of financial products and promote the interests of consumers of financial products
ga: Soláthraíonn an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC) faisnéis agus oideachas faoi na costais, rioscaí agus sochair táirgí airgeadais. Cuireann CCPC chun cinn na páirteanna tomhaltóirí táirgí airgeadais
